Repository: arkadeleon/ragnarok-offline
Catalog: Packages/RagnarokConstants/Sources/RagnarokConstants/Resources/Race.xcstrings
Source language: en
Languages: de, es, fr, id, it, ja, ko, pt_br, ru, th, tr, zh_hans, zh_hant

source: Angel
de: Engel
es: Ángel
fr: Ange
id: Malaikat
it: Angelo
ja: 天使
ko: 천사
pt_br: Anjo
ru: Ангел
th: นางฟ้า
tr: Melek
zh_hans: 天使
zh_hant: 天使

source: Brute
de: Tier
es: Animal
fr: Animal
id: Hewan
it: Animale
ja: 動物
ko: 동물
pt_br: Animal
ru: Животное
th: สัตว์
tr: Hayvan
zh_hans: 动物
zh_hant: 動物

source: Demi-Human
de: Halbmensch
es: Semi-Humano
fr: Demi-Humain
id: Setengah-Manusia
it: Semi-Umano
ja: 人形
ko: 인간형
pt_br: Semi-Humano
ru: Полулюди
th: กึ่งมนุษย์
tr: Yarı-İnsan
zh_hans: 人形
zh_hant: 人形

source: Demon
de: Dämon
es: Demonio
fr: Démon
id: Iblis
it: Demone
ja: 悪魔
ko: 악마
pt_br: Demônio
ru: Демон
th: ปีศาจ
tr: Şeytan
zh_hans: 恶魔
zh_hant: 惡魔

source: Doram Player
de: Doram-Spieler
es: Jugador Doram
fr: Joueur Doram
id: Pemain Doram
it: Giocatore Doram
ja: ドラムプレイヤー
ko: 도람 플레이어
pt_br: Jogador Doram
ru: Игрок-Дорам
th: ผู้เล่นโดแรม
tr: Doram Oyuncu
zh_hans: 多兰族玩家
zh_hant: 多蘭族玩家

source: Dragon
de: Drache
es: Dragón
id: Naga
it: Drago
ja: 龍族
ko: 용족
pt_br: Dragão
ru: Дракон
th: มังกร
tr: Ejder
zh_hans: 龙族
zh_hant: 龍族

source: Fish
de: Fisch
es: Pez
fr: Poisson
id: Ikan
it: Pesce
ja: 魚貝
ko: 어패류
pt_br: Peixe
ru: Рыба
th: ปลา
tr: Balık
zh_hans: 鱼贝
zh_hant: 魚貝

source: Formless
de: Formlos
es: Sin forma
fr: Sans forme
id: Tak Berbentuk
it: Senza forma
ja: 無形
ko: 무형
pt_br: Sem forma
ru: Бесформенный
th: ไร้รูปร่าง
tr: Şekilsiz
zh_hans: 无形
zh_hant: 無形

source: Human Player
de: Menschlicher Spieler
es: Jugador Humano
fr: Joueur Humain
id: Pemain Manusia
it: Giocatore Umano
ja: 人間プレイヤー
ko: 인간 플레이어
pt_br: Jogador Humano
ru: Игрок-человек
th: ผู้เล่นมนุษย์
tr: İnsan Oyuncu
zh_hans: 人类玩家
zh_hant: 人類玩家

source: Insect
de: Insekt
es: Insecto
fr: Insecte
id: Serangga
it: Insetto
ja: 昆虫
ko: 곤충
pt_br: Inseto
ru: Насекомое
th: แมลง
tr: Böcek
zh_hans: 昆虫
zh_hant: 昆蟲

source: Plant
de: Pflanze
es: Planta
fr: Plante
id: Tumbuhan
it: Pianta
ja: 植物
ko: 식물
pt_br: Planta
ru: Растение
th: พืช
tr: Bitki
zh_hans: 植物
zh_hant: 植物

source: Undead
de: Untot
es: No-muerto
fr: Mort-vivant
id: Mayat Hidup
it: Non-morto
ja: 不死
ko: 불사
pt_br: Morto-vivo
ru: Нежить
th: อันเดด
tr: Ölümsüz
zh_hans: 不死
zh_hant: 不死
